Revit 2027 API
IFCCategoryTemplate.Create Method
 Create a IFC category mapping template with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCCategoryTemplate Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As IFCCategoryTemplate
public:
static IFCCategoryTemplate^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> IFCCategoryTemplate
Parameters
document Document
 Document where created mapping template is saved.
name String
 The name specified to this mapping template.
Return Value
IFCCategoryTemplate
 The new mapping template instance.
Exceptions
Exception | Condition
ArgumentException |  The name already exists.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace